In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    'city':['New York','Chicago','Orlando'],
    'temperature':[23,42,52]
})

In [4]:
df2 = pd.DataFrame({
    'city':['New York','Chicago','Orlando'],
    'humidity':[52,21,64]
})

In [8]:
df3 = pd.merge(df1,df2,on='city')

In [9]:
df3

       city  temperature  humidity
0  New York           23        52
1   Chicago           42        21
2   Orlando           52        64

Now in case of no rows in temperature and humidity are not same 
In such Cases UNION OPERATION of set theroy occurs
Let's See

In [10]:
df1 = pd.DataFrame({
    'city':['New York','Chicago','Orlando','Vatican_city','georgia'],
    'temperature':[23,42,52,67,35]
})

In [11]:
df2 = pd.DataFrame({
    'city':['New York','Chicago','Orlando'],
    'humidity':[52,21,64]
})

In [12]:
df3 = pd.merge(df1,df2,on='city')

In [13]:
df3

       city  temperature  humidity
0  New York           23        52
1   Chicago           42        21
2   Orlando           52        64

As in above Dataframe you can see only common city  are included .
To avail the full Data for rest of the city . #How function is included

In [18]:
df3 = pd.merge(df1,df2,how='outer',indicator = True) # Indicator will tell the value of data from which side it is included

In [19]:
df3

           city  temperature  humidity     _merge
0      New York           23      52.0       both
1       Chicago           42      21.0       both
2       Orlando           52      64.0       both
3  Vatican_city           67       NaN  left_only
4       georgia           35       NaN  left_only

In [20]:
df1 = pd.DataFrame({
    'city':['New York','Chicago','Orlando'],
    'temperature':[23,42,52],
    'humidity':[52,21,64]
})

In [21]:
df1

       city  temperature  humidity
0  New York           23        52
1   Chicago           42        21
2   Orlando           52        64

In [24]:
df2 = pd.DataFrame({
    'city':['New York','Chicago','Orlando','Vatican_city','georgia'],
    'temperature':[23,42,52,67,35],
    'humidity':[52,21,64,32,43]
})

In [25]:
df2

           city  temperature  humidity
0      New York           23        52
1       Chicago           42        21
2       Orlando           52        64
3  Vatican_city           67        32
4       georgia           35        43

In [26]:
df3 = pd.merge(df1,df2,on='city')
df3

           city  temperature_x  humidity_x  temperature_y  humidity_y
0      New York             23          52             23          52
1       Chicago             42          21             42          21
2       Orlando             52          64             52          64
3  Vatican_city             67          32             67          32
4       georgia             35          43             35          43